<?php
declare(strict_types=1);

/**
 *=====================================================
 * Majestic Next Engine                               =
 *=====================================================
 * @package path.php                                  =
 *-----------------------------------------------------
 * @url http://majestic-studio.com/                   =
 *-----------------------------------------------------
 * @copyright 2021 Majestic Studio                    =
 *=====================================================
 * @author ZerxaFun aKa Zerxa                         =
 *=====================================================
 * @license GPL version 3                             =
 *=====================================================
 * Базовые настройки маршрутов проекта                =
 *                                                    =
 *=====================================================
 */

return [
    /**
     * @params basePath - базовый путь к корню директории проекта
     */
    'basePath'      => dirname(__DIR__),
];